###############################################################
#  Generated by:      Cadence Innovus 18.10-p002_1
#  OS:                Linux x86_64(Host ID shell)
#  Generated on:      Mon Feb 17 22:36:31 2025
#  Design:            mult_ver
#  Command:           saveDesign saves/mult_ver_postcts
###############################################################
current_design mult_ver
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.12 [get_clocks {clk}]
set_clock_transition  -fall -max 0.12 [get_clocks {clk}]
create_clock  -name v_clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk}]
set_max_fanout 1  [get_ports {clk}]
set_input_transition -rise 0.1  [get_ports {clk}]
set_input_transition -fall 0.12  [get_ports {clk}]
set_max_fanout 1  [get_ports {rst_n}]
set_input_transition -rise 0.1  [get_ports {rst_n}]
set_input_transition -fall 0.12  [get_ports {rst_n}]
set_max_fanout 1  [get_ports {a[3]}]
set_input_transition -rise 0.1  [get_ports {a[3]}]
set_input_transition -fall 0.12  [get_ports {a[3]}]
set_max_fanout 1  [get_ports {a[2]}]
set_input_transition -rise 0.1  [get_ports {a[2]}]
set_input_transition -fall 0.12  [get_ports {a[2]}]
set_max_fanout 1  [get_ports {a[1]}]
set_input_transition -rise 0.1  [get_ports {a[1]}]
set_input_transition -fall 0.12  [get_ports {a[1]}]
set_max_fanout 1  [get_ports {a[0]}]
set_input_transition -rise 0.1  [get_ports {a[0]}]
set_input_transition -fall 0.12  [get_ports {a[0]}]
set_max_fanout 1  [get_ports {b[3]}]
set_input_transition -rise 0.1  [get_ports {b[3]}]
set_input_transition -fall 0.12  [get_ports {b[3]}]
set_max_fanout 1  [get_ports {b[2]}]
set_input_transition -rise 0.1  [get_ports {b[2]}]
set_input_transition -fall 0.12  [get_ports {b[2]}]
set_max_fanout 1  [get_ports {b[1]}]
set_input_transition -rise 0.1  [get_ports {b[1]}]
set_input_transition -fall 0.12  [get_ports {b[1]}]
set_max_fanout 1  [get_ports {b[0]}]
set_input_transition -rise 0.1  [get_ports {b[0]}]
set_input_transition -fall 0.12  [get_ports {b[0]}]
set_load -pin_load -max  0.2  [get_ports {c[7]}]
set_load -pin_load -min  0.2  [get_ports {c[7]}]
set_load -pin_load -max  0.2  [get_ports {c[6]}]
set_load -pin_load -min  0.2  [get_ports {c[6]}]
set_load -pin_load -max  0.2  [get_ports {c[5]}]
set_load -pin_load -min  0.2  [get_ports {c[5]}]
set_load -pin_load -max  0.2  [get_ports {c[4]}]
set_load -pin_load -min  0.2  [get_ports {c[4]}]
set_load -pin_load -max  0.2  [get_ports {c[3]}]
set_load -pin_load -min  0.2  [get_ports {c[3]}]
set_load -pin_load -max  0.2  [get_ports {c[2]}]
set_load -pin_load -min  0.2  [get_ports {c[2]}]
set_load -pin_load -max  0.2  [get_ports {c[1]}]
set_load -pin_load -min  0.2  [get_ports {c[1]}]
set_load -pin_load -max  0.2  [get_ports {c[0]}]
set_load -pin_load -min  0.2  [get_ports {c[0]}]
set_max_capacitance 0.5  [get_designs {mult_ver}]
set_max_transition 1.5  [get_designs {mult_ver}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {b[2]}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {rst_n}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {b[0]}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {a[3]}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {a[1]}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {b[3]}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {b[1]}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {a[2]}]
set_input_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {a[0]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[6]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[4]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[2]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[0]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[7]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[5]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[3]}]
set_output_delay -add_delay 3 -clock [get_clocks {v_clk}] [get_ports {c[1]}]
set_clock_uncertainty 0.3 -hold [get_clocks {clk}]
set_clock_uncertainty 0.5 -setup [get_clocks {clk}]
